app/controllers/comment_controller.rb

  def create
    @product = Product.find(params[:id])
    @comment = @product.comments.create(comment_params)
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("comment", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "sgdsg"], ["created_at", "2014-11-22 17:42:30.091074"], ["product_id", 1], ["updated_at", "2014-11-22 17:42:30.091074"]]