app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    # @product = Product.find(1)

    @products = Product.all

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."product_id" = 2 LIMIT 1
---
  def show
    @shop = Shop.find(params[:shop_id])
    @product = @shop.products.find(params[:id])
    @comments = @product.comments.all

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
   @shop = Shop.find(params[:shop_id])
   @product = @shop.products.find(params[:id])

INSERT INTO "products" ("created_at", "description", "name", "photo", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-11-14 07:11:58.829884"], ["description", "the zen of beads"], ["name", "Akwuke beads"], ["photo", "pic"], ["price", 5], ["updated_at", "2014-11-14 07:11:58.829884"]]
---
  def create
    @shop = Shop.find(params[:shop_id])
    @product = @shop.products.new(product_params)


    respond_to do |format|
      if @product.save

UPDATE "products" SET "description" = ?, "image" = ?, "name" = ?, "updated_at" = ? WHERE "products"."id" = 9  [["description", "With love from India, our rubies come with a view to flatter"], ["image", "s9.png"], ["name", "Indian Rupies"], ["updated_at", "2014-11-17 11:43:32.959568"]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)